MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F1010/mcu.h
/* CNPU1 */
#define _CN0PUE CNPU1bits.CN0PUE
#define _CN1PUE CNPU1bits.CN1PUE
#define _CN2PUE CNPU1bits.CN2PUE
#define _CN3PUE CNPU1bits.CN3PUE
#define _CN4PUE CNPU1bits.CN4PUE
#define _CN5PUE CNPU1bits.CN5PUE
#define _CN6PUE CNPU1bits.CN6PUE
#define _CN7PUE CNPU1bits.CN7PUE

/* INTCON1 */
#define _OSCFAIL INTCON1bits.OSCFAIL
#define _STKERR INTCON1bits.STKERR
#define _ADDRERR INTCON1bits.ADDRERR
#define _MATHERR INTCON1bits.MATHERR
#define _DIV0ERR INTCON1bits.DIV0ERR
#define _SFTACERR INTCON1bits.SFTACERR
#define _COVTE INTCON1bits.COVTE
#define _OVBTE INTCON1bits.OVBTE
#define _OVATE INTCON1bits.OVATE
#define _COVBERR INTCON1bits.COVBERR
#define _COVAERR INTCON1bits.COVAERR
#define _OVBERR INTCON1bits.OVBERR
#define _OVAERR INTCON1bits.OVAERR
#define _NSTDIS INTCON1bits.NSTDIS

/* INTCON2 */
#define _INT0EP INTCON2bits.INT0EP
#define _INT1EP INTCON2bits.INT1EP
#define _INT2EP INTCON2bits.INT2EP
#define _DISI INTCON2bits.DISI
#define _ALTIVT INTCON2bits.ALTIVT

/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _OC1IF IFS0bits.OC1IF
#define _T1IF IFS0bits.T1IF
#define _T2IF IFS0bits.T2IF
#define _SPI1IF IFS0bits.SPI1IF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _ADIF IFS0bits.ADIF
#define _NVMIF IFS0bits.NVMIF
#define _SI2CIF IFS0bits.SI2CIF
#define _MI2CIF IFS0bits.MI2CIF

/* IFS1 */
#define _INT1IF IFS1bits.INT1IF
#define _INT2IF IFS1bits.INT2IF
#define _PSEMIF IFS1bits.PSEMIF
#define _PWM1IF IFS1bits.PWM1IF
#define _PWM2IF IFS1bits.PWM2IF
#define _CNIF IFS1bits.CNIF
#define _AC1IF IFS1bits.AC1IF
#define _AC2IF IFS1bits.AC2IF
#define _PWMEVIF IFS1bits.PWMEVIF

/* IFS2 */
#define _ADCP0IF IFS2bits.ADCP0IF
#define _ADCP1IF IFS2bits.ADCP1IF
#define _ADCP2IF IFS2bits.ADCP2IF

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _OC1IE IEC0bits.OC1IE
#define _T1IE IEC0bits.T1IE
#define _T2IE IEC0bits.T2IE
#define _SPI1IE IEC0bits.SPI1IE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _ADIE IEC0bits.ADIE
#define _NVMIE IEC0bits.NVMIE
#define _SI2CIE IEC0bits.SI2CIE
#define _MI2CIE IEC0bits.MI2CIE

/* IEC1 */
#define _INT1IE IEC1bits.INT1IE
#define _INT2IE IEC1bits.INT2IE
#define _PSEMIE IEC1bits.PSEMIE
#define _PWM1IE IEC1bits.PWM1IE
#define _PWM2IE IEC1bits.PWM2IE
#define _CNIE IEC1bits.CNIE
#define _AC1IE IEC1bits.AC1IE
#define _AC2IE IEC1bits.AC2IE
#define _PWMEVIE IEC1bits.PWMEVIE

/* IEC2 */
#define _ADCP0IE IEC2bits.ADCP0IE
#define _ADCP1IE IEC2bits.ADCP1IE
#define _ADCP2IE IEC2bits.ADCP2IE

/* IPC0 */
#define _INT0IP IPC0bits.INT0IP
#define _OC1IP IPC0bits.OC1IP
#define _T1IP IPC0bits.T1IP
#define _INT0IP0 IPC0bits.INT0IP0
#define _INT0IP1 IPC0bits.INT0IP1
#define _INT0IP2 IPC0bits.INT0IP2
#define _OC1IP0 IPC0bits.OC1IP0
#define _OC1IP1 IPC0bits.OC1IP1
#define _OC1IP2 IPC0bits.OC1IP2
#define _T1IP0 IPC0bits.T1IP0
#define _T1IP1 IPC0bits.T1IP1
#define _T1IP2 IPC0bits.T1IP2

/* IPC1 */
#define _T2IP IPC1bits.T2IP
#define _T2IP0 IPC1bits.T2IP0
#define _T2IP1 IPC1bits.T2IP1
#define _T2IP2 IPC1bits.T2IP2

/* IPC2 */
#define _SPI1IP IPC2bits.SPI1IP
#define _U1RXIP IPC2bits.U1RXIP
#define _U1TXIP IPC2bits.U1TXIP
#define _ADIP IPC2bits.ADIP
#define _SPI1IP0 IPC2bits.SPI1IP0
#define _SPI1IP1 IPC2bits.SPI1IP1
#define _SPI1IP2 IPC2bits.SPI1IP2
#define _U1RXIP0 IPC2bits.U1RXIP0
#define _U1RXIP1 IPC2bits.U1RXIP1
#define _U1RXIP2 IPC2bits.U1RXIP2
#define _U1TXIP0 IPC2bits.U1TXIP0
#define _U1TXIP1 IPC2bits.U1TXIP1
#define _U1TXIP2 IPC2bits.U1TXIP2
#define _ADIP0 IPC2bits.ADIP0
#define _ADIP1 IPC2bits.ADIP1
#define _ADIP2 IPC2bits.ADIP2

/* IPC3 */
#define _NVMIP IPC3bits.NVMIP
#define _SI2CIP IPC3bits.SI2CIP
#define _MI2CIP IPC3bits.MI2CIP
#define _NVMIP0 IPC3bits.NVMIP0
#define _NVMIP1 IPC3bits.NVMIP1
#define _NVMIP2 IPC3bits.NVMIP2
#define _SI2CIP0 IPC3bits.SI2CIP0
#define _SI2CIP1 IPC3bits.SI2CIP1
#define _SI2CIP2 IPC3bits.SI2CIP2
#define _MI2CIP0 IPC3bits.MI2CIP0
#define _MI2CIP1 IPC3bits.MI2CIP1
#define _MI2CIP2 IPC3bits.MI2CIP2

/* IPC4 */
#define _INT1IP IPC4bits.INT1IP
#define _INT2IP IPC4bits.INT2IP
#define _PSEMIP IPC4bits.PSEMIP
#define _PWM1IP IPC4bits.PWM1IP
#define _INT1IP0 IPC4bits.INT1IP0
#define _INT1IP1 IPC4bits.INT1IP1
#define _INT1IP2 IPC4bits.INT1IP2
#define _INT2IP0 IPC4bits.INT2IP0
#define _INT2IP1 IPC4bits.INT2IP1
#define _INT2IP2 IPC4bits.INT2IP2
#define _PSEMIP0 IPC4bits.PSEMIP0
#define _PSEMIP1 IPC4bits.PSEMIP1
#define _PSEMIP2 IPC4bits.PSEMIP2
#define _PWM1IP0 IPC4bits.PWM1IP0
#define _PWM1IP1 IPC4bits.PWM1IP1
#define _PWM1IP2 IPC4bits.PWM1IP2

/* IPC5 */
#define _PWM2IP IPC5bits.PWM2IP
#define _PWM2IP0 IPC5bits.PWM2IP0
#define _PWM2IP1 IPC5bits.PWM2IP1
#define _PWM2IP2 IPC5bits.PWM2IP2

/* IPC6 */
#define _CNIP IPC6bits.CNIP
#define _CNIP0 IPC6bits.CNIP0
#define _CNIP1 IPC6bits.CNIP1
#define _CNIP2 IPC6bits.CNIP2

/* IPC7 */
#define _AC1IP IPC7bits.AC1IP
#define _AC2IP IPC7bits.AC2IP
#define _AC1IP0 IPC7bits.AC1IP0
#define _AC1IP1 IPC7bits.AC1IP1
#define _AC1IP2 IPC7bits.AC1IP2
#define _AC2IP0 IPC7bits.AC2IP0
#define _AC2IP1 IPC7bits.AC2IP1
#define _AC2IP2 IPC7bits.AC2IP2

/* IPC9 */
#define _ADCP0IP IPC9bits.ADCP0IP
#define _ADCP1IP IPC9bits.ADCP1IP
#define _ADCP2IP IPC9bits.ADCP2IP
#define _ADCP0IP0 IPC9bits.ADCP0IP0
#define _ADCP0IP1 IPC9bits.ADCP0IP1
#define _ADCP0IP2 IPC9bits.ADCP0IP2
#define _ADCP1IP0 IPC9bits.ADCP1IP0
#define _ADCP1IP1 IPC9bits.ADCP1IP1
#define _ADCP1IP2 IPC9bits.ADCP1IP2
#define _ADCP2IP0 IPC9bits.ADCP2IP0
#define _ADCP2IP1 IPC9bits.ADCP2IP1
#define _ADCP2IP2 IPC9bits.ADCP2IP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1

/* T2CON */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
#define _T32 T2CONbits.T32
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
/* Bitname _TSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS1 cannot be defined because it is used by more than one SFR */

/* OC1CON */
#define _OCM OC1CONbits.OCM
#define _OCTSEL OC1CONbits.OCTSEL
#define _OCFLT OC1CONbits.OCFLT
#define _OCSIDL OC1CONbits.OCSIDL
#define _OCM0 OC1CONbits.OCM0
#define _OCM1 OC1CONbits.OCM1
#define _OCM2 OC1CONbits.OCM2

/* I2CRCV */
#define _I2CRCV I2CRCVbits.I2CRCV
#define _I2CRCV0 I2CRCVbits.I2CRCV0
#define _I2CRCV1 I2CRCVbits.I2CRCV1
#define _I2CRCV2 I2CRCVbits.I2CRCV2
#define _I2CRCV3 I2CRCVbits.I2CRCV3
#define _I2CRCV4 I2CRCVbits.I2CRCV4
#define _I2CRCV5 I2CRCVbits.I2CRCV5
#define _I2CRCV6 I2CRCVbits.I2CRCV6
#define _I2CRCV7 I2CRCVbits.I2CRCV7

